{
  "interview_id": "session_001",
  "language": "th-TH",
  "questions": [
    {
      "id": "q1",
      "category": "พฤติกรรมการทำงาน",
      "text": "เล่าให้ฟังหน่อยว่าคุณจัดลำดับความสำคัญของงานแต่ละวันอย่างไร?",
      "followUpTemplates": [
        "อะไรทำให้คุณจัดลำดับแบบนั้น?",
        "มีเหตุการณ์ไหนที่ทำให้แผนเปลี่ยนกลางคันบ่อยไหม?",
        "คุณรู้สึกอย่างไรเวลาต้องสลับงานหลายครั้ง?",
        "อะไรช่วยให้งานไหลลื่นที่สุด?"
      ]
    },
    {
      "id": "q2",
      "category": "การแก้ปัญหา",
      "text": "ครั้งล่าสุดที่คุณเจอปัญหาในงาน คุณแก้ไขอย่างไร?",
      "followUpTemplates": [
        "อะไรคือความยากที่สุดในเหตุการณ์นั้น?",
        "คุณตัดสินใจลำดับการแก้ปัญหาอย่างไร?",
        "ผลลัพธ์ออกมาเป็นอย่างไร?",
        "คุณรู้สึกว่าเรียนรู้อะไรจากเหตุการณ์นี้?"
      ]
    },
    {
      "id": "q3",
      "category": "แรงจูงใจ",
      "text": "อะไรคือแรงจูงใจหลักในการทำงานของคุณ?",
      "followUpTemplates": [
        "แรงจูงใจนี้เริ่มมาตั้งแต่เมื่อไหร่?",
        "อะไรทำให้คุณยังรู้สึกแบบนี้จนถึงทุกวันนี้?",
        "มีช่วงไหนที่แรงจูงใจลดลงไหม? ทำไม?",
        "อะไรที่ทำให้คุณรู้สึกภูมิใจที่สุด?"
      ]
    },
    {
      "id": "q4",
      "category": "การทำงานร่วมกัน",
      "text": "อะไรคืออุปสรรคใหญ่ที่สุดเวลาทำงานร่วมกับผู้อื่น?",
      "followUpTemplates": [
        "อะไรทำให้สถานการณ์นั้นเกิดขึ้น?",
        "คุณจัดการกับสถานการณ์นั้นอย่างไร?",
        "มีวิธีไหนที่จะปรับปรุงได้?",
        "คุณคิดว่าอะไรคือการทำงานร่วมกันที่ดี?"
      ]
    },
    {
      "id": "q5",
      "category": "การเติบโต",
      "text": "สิ่งที่คุณอยากพัฒนาตัวเองในปีนี้คืออะไร?",
      "followUpTemplates": [
        "ทำไมสิ่งนี้ถึงสำคัญกับคุณ?",
        "มีอะไรที่ขวางทางคุณอยู่ไหม?",
        "คุณวางแผนพัฒนาอย่างไร?",
        "คุณจะรู้ได้อย่างไรว่าคุณพัฒนาแล้ว?"
      ]
    },
    {
      "id": "q6",
      "category": "ประสบการณ์",
      "text": "เล่าเหตุการณ์ที่คุณรู้สึกว่าประสบความสำเร็จที่สุดในการทำงาน",
      "followUpTemplates": [
        "อะไรทำให้เหตุการณ์นั้นประสบความสำเร็จ?",
        "คุณมีส่วนสำคัญอย่างไรในความสำเร็จนั้น?",
        "มีอุปสรรคอะไรบ้างที่คุณต้องเผชิญ?",
        "คุณนำประสบการณ์นี้ไปใช้อย่างไรในงานอื่น?"
      ]
    },
    {
      "id": "q7",
      "category": "ความท้าทาย",
      "text": "มีเหตุการณ์ไหนที่ผิดพลาดแล้วคุณได้เรียนรู้อะไร?",
      "followUpTemplates": [
        "อะไรทำให้เกิดความผิดพลาดนั้น?",
        "คุณรู้สึกอย่างไรในตอนนั้น?",
        "คุณจัดการกับสถานการณ์อย่างไร?",
        "ถ้าเจอสถานการณ์แบบนี้อีก คุณจะทำอย่างไร?"
      ]
    },
    {
      "id": "q8",
      "category": "สภาพแวดล้อม",
      "text": "คุณอยากให้สภาพแวดล้อมการทำงานในอุดมคติเป็นแบบไหน?",
      "followUpTemplates": [
        "อะไรคือสิ่งสำคัญที่สุดในสภาพแวดล้อมการทำงาน?",
        "สภาพแวดล้อมปัจจุบันแตกต่างจากอุดมคติอย่างไร?",
        "อะไรที่คุณสามารถเปลี่ยนแปลงได้เอง?",
        "คุณเคยทำงานในสภาพแวดล้อมที่ดีที่สุดเป็นอย่างไร?"
      ]
    },
    {
      "id": "q9",
      "category": "การสื่อสาร",
      "text": "คุณชอบรับ feedback แบบไหน?",
      "followUpTemplates": [
        "ทำไมคุณถึงชอบแบบนั้น?",
        "เคยได้รับ feedback ที่ดีที่สุดเป็นอย่างไร?",
        "เคยได้รับ feedback ที่ทำให้รู้สึกไม่ดีไหม?",
        "คุณให้ feedback กับคนอื่นอย่างไร?"
      ]
    },
    {
      "id": "q10",
      "category": "ความสำเร็จ",
      "text": "คุณมองคำว่า 'ความสำเร็จ' ว่าอย่างไร?",
      "followUpTemplates": [
        "ความสำเร็จของคุณเหมือนหรือต่างจากคนอื่นอย่างไร?",
        "อะไรทำให้คุณรู้สึกว่าประสบความสำเร็จ?",
        "คุณวัดความสำเร็จอย่างไร?",
        "ความสำเร็จของคุณเปลี่ยนไปตามเวลาไหม?"
      ]
    }
  ]
}
